testsuite/sysbench/results/oltp_point_select.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 85973.02 qps: 85973.02 (r/w/o: 85973.02/0.00/0.00) lat (ms,95%): 0.78 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 86081.12 qps: 86081.12 (r/w/o: 86081.12/0.00/0.00) lat (ms,95%): 0.77 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 86150.90 qps: 86150.90 (r/w/o: 86150.90/0.00/0.00) lat (ms,95%): 0.78 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            5167086
        write:                           0
        other:                           0
        total:                           5167086
    transactions:                        5167086 (86106.31 per sec.)
    queries:                             5167086 (86106.31 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      86106.3082
    time elapsed:                        60.0084s
    total number of events:              5167086

Latency (ms):
         min:                                    0.15
         avg:                                    0.74
         max:                                   17.79
         95th percentile:                        0.78
         sum:                              3836166.75

Threads fairness:
    events (avg/stddev):           80732.9062/326.38
    execution time (avg/stddev):   59.9401/0.00

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 96021.71 qps: 96021.71 (r/w/o: 96021.71/0.00/0.00) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 96263.40 qps: 96263.40 (r/w/o: 96263.40/0.00/0.00) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 96258.28 qps: 96258.28 (r/w/o: 96258.28/0.00/0.00) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            5776404
        write:                           0
        other:                           0
        total:                           5776404
    transactions:                        5776404 (96259.42 per sec.)
    queries:                             5776404 (96259.42 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      96259.4198
    time elapsed:                        60.0089s
    total number of events:              5776404

Latency (ms):
         min:                                    0.14
         avg:                                    0.66
         max:                                    5.91
         95th percentile:                        0.83
         sum:                              3835906.91

Threads fairness:
    events (avg/stddev):           90252.5938/4020.75
    execution time (avg/stddev):   59.9360/0.00